MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM37AFSQG/mcu.h
/**
 *******************************************************************************
 * @file    TMPM37A.h
 * @brief   CMSIS Cortex-M3 Core Peripheral Access Layer Header File for the
 *          TOSHIBA 'TMPM37A' Device Series
 * @version V2.0.2.1 (Tentative)
 * @date    2015/10/08
 * 
 * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
 * 
 * (C)Copyright TOSHIBA CORPORATION 2015 All rights reserved
 *******************************************************************************
 */

/** @addtogroup TOSHIBA_TX03_MICROCONTROLLER
  * @{
  */

/** @addtogroup TMPM37A
  * @{
  */

#ifndef __TMPM37A_H__
#define __TMPM37A_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Configuration_of_CMSIS
  * @{
  */

/** Interrupt Number Definition */
    typedef enum IRQn {
/******  Cortex-M3 Processor Exceptions Numbers ***************************************************************/
        NonMaskableInt_IRQn = -14,      /*!< 2 Non Maskable Interrupt                                    */
        HardFault_IRQn = -13,   /*!< 3 Cortex-M3 Hard Fault Interrupt                            */
        MemoryManagement_IRQn = -12,    /*!< 4 Cortex-M3 Memory Management Interrupt                     */
        BusFault_IRQn = -11,    /*!< 5 Cortex-M3 Bus Fault Interrupt                             */
        UsageFault_IRQn = -10,  /*!< 6 Cortex-M3 Usage Fault Interrupt                           */
        SVCall_IRQn = -5,       /*!< 11 Cortex-M3 SV Call Interrupt                              */
        DebugMonitor_IRQn = -4, /*!< 12 Cortex-M3 Debug Monitor Interrupt                        */
        PendSV_IRQn = -2,       /*!< 14 Cortex-M3 Pend SV Interrupt                              */
        SysTick_IRQn = -1,      /*!< 15 Cortex-M3 System Tick Interrupt                          */

/******  TMPM37A Specific Interrupt Numbers *******************************************************************/
        INTRX0_IRQn = 0,        /*!< Serial reception (channel.0)                                */
        INTTX0_IRQn = 1,        /*!< Serial transmit (channel.0)                                 */
        INTVCNB_IRQn = 4,       /*!< Vector Engine interrupt B                                   */
        INTEMG_IRQn = 5,        /*!< PMD EMG interrupt                                           */
        INTOVV_IRQn = 6,        /*!< PMD OVV interrupt                                           */
        INTADPDB_IRQn = 7,      /*!< ADC conversion triggered by PMD is finished                 */
        INTTB00_IRQn = 8,       /*!< 16bit TMRB0 compare match detection 0/ Over flow            */
        INTTB01_IRQn = 9,       /*!< 16bit TMRB0 compare match detection 1                       */
        INTTB40_IRQn = 10,      /*!< 16bit TMRB4 compare match detection 0/ Over flow            */
        INTTB41_IRQn = 11,      /*!< 16bit TMRB4 compare match detection 1                       */
        INTTB50_IRQn = 12,      /*!< 16bit TMRB5 compare match detection 0/ Over flow            */
        INTTB51_IRQn = 13,      /*!< 16bit TMRB5 compare match detection 1                       */
        INTPMD_IRQn = 14,       /*!< PMD PWM interrupt                                           */
        INTCAP00_IRQn = 15,     /*!< 16bit TMRB0 input capture 0                                 */
        INTCAP01_IRQn = 16,     /*!< 16bit TMRB0 input capture 1                                 */
        INTCAP40_IRQn = 17,     /*!< 16bit TMRB4 input capture 0                                 */
        INTCAP41_IRQn = 18,     /*!< 16bit TMRB4 input capture 1                                 */
        INT6_IRQn = 19,         /*!< Interrupt Pin (PE0/14pin)                                   */
        INT7_IRQn = 20,         /*!< Interrupt Pin (PE2/16pin)                                   */
        INTADCPA_IRQn = 21,     /*!< ADC conversion monitoring function interrupt A              */
        INTADCPB_IRQn = 22,     /*!< ADC conversion monitoring function interrupt B              */
        INTADSFT_IRQn = 23,     /*!< ADC conversion started by software is finished              */
        INTADTMR_IRQn = 24,     /*!< ADC conversion triggered by timer is finished               */
        INTTB70_IRQn = 26,      /*!< 16bit TMRB7 compare match detection 0 / Over flow           */
        INTTB71_IRQn = 27,      /*!< 16bit TMRB7 compare match detection 1                       */
        INTCAP70_IRQn = 28,     /*!< 16bit TMRB7 input capture 0                                 */
        INTCAP71_IRQn = 29,     /*!< 16bit TMRB7 input capture 1                                 */
        INTC_IRQn = 30,         /*!< Interrupt Pin (PF0/17pin)                                   */
        INTSBI0_IRQn = 31       /*!< Serial Bus Interface0                                       */
    } IRQn_Type;

/** Processor and Core Peripheral Section */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __CM3_REV              0x0201   /*!< Cortex-M3 Core Revision                           */
#define __MPU_PRESENT             0     /*!< MPU present or not                                */
#define __NVIC_PRIO_BITS          3     /*!< Number of Bits used for Priority Levels           */
#define __Vendor_SysTickConfig    0     /*!< Set to 1 if different SysTick Config is used      */

    /** @} *//* End of group Configuration_of_CMSIS */

#include "core_cm3.h"           /* Cortex-M3 processor and core peripherals            */
// Note: Changed for MikroE implementation.
// #include "system_TMPM37A.h"     /* TMPM37A System                                      */

/** @addtogroup Device_Peripheral_registers
  * @{
  */

/** Device Specific Peripheral registers structures */

/**
  * @brief General Purpose Input/Output Port (PB)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PB Register                                  */
        __IO uint32_t CR;       /*!< PB Control Register                          */
        __IO uint32_t FR1;      /*!< PB Function Register 1                       */
        __IO uint32_t FR2;      /*!< PB Function Register 2                       */
        uint32_t RESERVED0;
        __IO uint32_t FR4;      /*!< PB Function Register 4                       */
        uint32_t RESERVED1[4];
        __IO uint32_t OD;       /*!< PB Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PB Pull-Up Control Register                  */
        __IO uint32_t PDN;      /*!< PB Pull-Down Control Register                */
        uint32_t RESERVED2;
        __IO uint32_t IE;       /*!< PB Input Enable Control Register             */
    } TSB_PB_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PE)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PE Register                                  */
        __IO uint32_t CR;       /*!< PE Control Register                          */
        __IO uint32_t FR1;      /*!< PE Function Register 1                       */
        __IO uint32_t FR2;      /*!< PE Function Register 2                       */
        uint32_t RESERVED0;
        __IO uint32_t FR4;      /*!< PE Function Register 4                       */
        __IO uint32_t FR5;      /*!< PE Function Register 5                       */
        __IO uint32_t FR6;      /*!< PE Function Register 6                       */
        uint32_t RESERVED1[2];
        __IO uint32_t OD;       /*!< PE Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PE Pull-Up Control Register                  */
        __IO uint32_t PDN;      /*!< PE Pull-Down Control Register                */
        uint32_t RESERVED2;
        __IO uint32_t IE;       /*!< PE Input Enable Control Register             */
    } TSB_PE_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PF)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PF Register                                  */
        __IO uint32_t CR;       /*!< PF Control Register                          */
        __IO uint32_t FR1;      /*!< PF Function Register 1                       */
        __IO uint32_t FR2;      /*!< PF Function Register 2                       */
        uint32_t RESERVED0;
        __IO uint32_t FR4;      /*!< PF Function Register 4                       */
        uint32_t RESERVED1[4];
        __IO uint32_t OD;       /*!< PF Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PF Pull-Up Control Register                  */
        __IO uint32_t PDN;      /*!< PF Pull-Down Control Register                */
        uint32_t RESERVED2;
        __IO uint32_t IE;       /*!< PF Input Enable Control Register             */
    } TSB_PF_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PJ)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PJ Register                                  */
        __IO uint32_t CR;       /*!< PJ Control Register                          */
        uint32_t RESERVED0[8];
        __IO uint32_t OD;       /*!< PJ Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PJ Pull-Up Control Register                  */
        __IO uint32_t PDN;      /*!< PJ Pull-Down Control Register                */
        uint32_t RESERVED1;
        __IO uint32_t IE;       /*!< PJ Input Enable Control Register             */
    } TSB_PJ_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PK)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PK Register                                  */
        __IO uint32_t CR;       /*!< PK Control Register                          */
        uint32_t RESERVED0[8];
        __IO uint32_t OD;       /*!< PK Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PK Pull-Up Control Register                  */
        __IO uint32_t PDN;      /*!< PK Pull-Down Control Register                */
        uint32_t RESERVED1;
        __IO uint32_t IE;       /*!< PK Input Enable Control Register             */
    } TSB_PK_TypeDef;

/**
  * @brief General Purpose Input/Output Port (PM)
  */
    typedef struct {
        __IO uint32_t DATA;     /*!< PM Register                                  */
        __IO uint32_t CR;       /*!< PM Control Register                          */
        uint32_t RESERVED0[8];
        __IO uint32_t OD;       /*!< PM Open Drain Control Register               */
        __IO uint32_t PUP;      /*!< PM Pull-Up Control Register                  */
        __IO uint32_t PDN;      /*!< PM Pull-Down Control Register                */
        uint32_t RESERVED1;
        __IO uint32_t IE;       /*!< PM Input Enable Control Register             */
    } TSB_PM_TypeDef;

/**
  * @brief 16-bit Timer/Event Counter (TB)
  */
    typedef struct {
        __IO uint32_t EN;       /*!< TB Enable Register                           */
        __IO uint32_t RUN;      /*!< TB RUN Register                              */
        __IO uint32_t CR;       /*!< TB Control Register                          */
        __IO uint32_t MOD;      /*!< TB Mode Register                             */
        __IO uint32_t FFCR;     /*!< TB Flip-Flop Control Register                */
        __I uint32_t ST;        /*!< TB Status Register                           */
        __IO uint32_t IM;       /*!< TB Interrupt Mask Register                   */
        __I uint32_t UC;        /*!< TB Read Capture Register                     */
        __IO uint32_t RG0;      /*!< TB RG0 Timer Register                        */
        __IO uint32_t RG1;      /*!< TB RG1 Timer Register                        */
        __I uint32_t CP0;       /*!< TB CP0 Capture Register                      */
        __I uint32_t CP1;       /*!< TB CP1 Capture Register                      */
    } TSB_TB_TypeDef;

#if defined ( __CC_ARM   )      /* RealView Compiler */
#pragma anon_unions
#elif (defined (__ICCARM__))    /*  ICC Compiler     */
#pragma language=extended
#endif

/**
  * @brief Serial BusInterface(SBI)
  */
    typedef struct {
        __IO uint32_t CR0;      /*!< SBI Control Register 0                       */
        __IO uint32_t CR1;      /*!< SBI Control Register 1 (I2C Mode)            */
        __IO uint32_t DBR;      /*!< SBI Data Buffer Register                     */
        __IO uint32_t I2CAR;    /*!< SBI I2C Bus Address Register                 */
        union {
            __O uint32_t CR2;   /*!< SBI Control Register 2 (I2C Mode)            */
            __I uint32_t SR;    /*!< SBI Status Register (I2C Mode)               */
        };
        __IO uint32_t BR0;      /*!< SBI Baud Rate Register 0                     */
    } TSB_SBI_TypeDef;

/**
  * @brief Serial Channel (SC)
  */
    typedef struct {
        __IO uint32_t EN;       /*!< SC Enable Register                           */
        __IO uint32_t BUF;      /*!< SC Buffer Register                           */
        __IO uint32_t CR;       /*!< SC Control Register                          */
        __IO uint32_t MOD0;     /*!< SC Mode Control Register 0                   */
        __IO uint32_t BRCR;     /*!< SC Baud Rate Generator Control Register      */
        __IO uint32_t BRADD;    /*!< SC Baud Rate Generator Control Register 2    */
        __IO uint32_t MOD1;     /*!< SC Mode Control Register 1                   */
        __IO uint32_t MOD2;     /*!< SC Mode Control Register 2                   */
        __IO uint32_t RFC;      /*!< SC RX FIFO Configuration Register            */
        __IO uint32_t TFC;      /*!< SC TX FIFO Configuration Register            */
        __I uint32_t RST;       /*!< SC RX FIFO Status Register                   */
        __I uint32_t TST;       /*!< SC TX FIFO Status Register                   */
        __IO uint32_t FCNF;     /*!< SC FIFO Configuration Register               */
    } TSB_SC_TypeDef;

/**
  * @brief Analog-to-Digital Converter (AD)
  */
    typedef struct {
        __IO uint32_t CLK;      /*!< AD Conversion Clock Setting Register         */
        __IO uint32_t MOD0;     /*!< AD Mode Setting Register 0                   */
        __IO uint32_t MOD1;     /*!< AD Mode Setting Register 1                   */
        __I uint32_t MOD2;      /*!< AD Mode Setting Register 2                   */
        __IO uint32_t CMPCR0;   /*!< AD Monitoring Setting Register 0             */
        __IO uint32_t CMPCR1;   /*!< AD Monitoring Setting Register 1             */
        __IO uint32_t CMP0;     /*!< AD Conversion Result Compare Register 0      */
        __IO uint32_t CMP1;     /*!< AD Conversion Result Compare Register 1      */
        __I uint32_t REG0;      /*!< AD Conversion Result Register 0              */
        __I uint32_t REG1;      /*!< AD Conversion Result Register 1              */
        __I uint32_t REG2;      /*!< AD Conversion Result Register 2              */
        __I uint32_t REG3;      /*!< AD Conversion Result Register 3              */
        __I uint32_t REG4;      /*!< AD Conversion Result Register 4              */
        __I uint32_t REG5;      /*!< AD Conversion Result Register 5              */
        __I uint32_t REG6;      /*!< AD Conversion Result Register 6              */
        __I uint32_t REG7;      /*!< AD Conversion Result Register 7              */
        __I uint32_t REG8;      /*!< AD Conversion Result Register 8              */
        __I uint32_t REG9;      /*!< AD Conversion Result Register 9              */
        __I uint32_t REG10;     /*!< AD Conversion Result Register 10             */
        __I uint32_t REG11;     /*!< AD Conversion Result Register 11             */
        uint32_t RESERVED0[6];
        __IO uint32_t PSEL6;    /*!< PMD Trigger ProgramNumber Select Register 6  */
        __IO uint32_t PSEL7;    /*!< PMD Trigger ProgramNumber Select Register 7  */
        __IO uint32_t PSEL8;    /*!< PMD Trigger ProgramNumber Select Register 8  */
        __IO uint32_t PSEL9;    /*!< PMD Trigger ProgramNumber Select Register 9  */
        __IO uint32_t PSEL10;   /*!< PMD Trigger ProgramNumber Select Register 10 */
        __IO uint32_t PSEL11;   /*!< PMD Trigger ProgramNumber Select Register 11 */
        __IO uint32_t PINTS0;   /*!< PMD Trigger Interrupt Select Register 0      */
        __IO uint32_t PINTS1;   /*!< PMD Trigger Interrupt Select Register 1      */
        __IO uint32_t PINTS2;   /*!< PMD Trigger Interrupt Select Register 2      */
        __IO uint32_t PINTS3;   /*!< PMD Trigger Interrupt Select Register 3      */
        __IO uint32_t PINTS4;   /*!< PMD Trigger Interrupt Select Register 4      */
        __IO uint32_t PINTS5;   /*!< PMD Trigger Interrupt Select Register 5      */
        __IO uint32_t PSET0;    /*!< PMD Trigger Program Register 0               */
        __IO uint32_t PSET1;    /*!< PMD Trigger Program Register 1               */
        __IO uint32_t PSET2;    /*!< PMD Trigger Program Register 2               */
        __IO uint32_t PSET3;    /*!< PMD Trigger Program Register 3               */
        __IO uint32_t PSET4;    /*!< PMD Trigger Program Register 4               */
        __IO uint32_t PSET5;    /*!< PMD Trigger Program Register 5               */
        __IO uint32_t TSET03;   /*!< Timer Trigger Program Register 03            */
        __IO uint32_t TSET47;   /*!< Timer Trigger Program Register 47            */
        __IO uint32_t TSET811;  /*!< Timer Trigger Program Register 811           */
        __IO uint32_t SSET03;   /*!< Software Trigger Program Register 03         */
        __IO uint32_t SSET47;   /*!< Software Trigger Program Register 47         */
        __IO uint32_t SSET811;  /*!< Software Trigger Program Register 811        */
        __IO uint32_t ASET03;   /*!< Constant Trigger Program Register 03         */
        __IO uint32_t ASET47;   /*!< Constant Trigger Program Register 47         */
        __IO uint32_t ASET811;  /*!< Constant Trigger Program Register 811        */
        __IO uint32_t MOD3;     /*!< Mode setting Register3                       */
    } TSB_AD_TypeDef;

/**
  * @brief Ope-AMP control 
  */
    typedef struct {
        uint32_t RESERVED0[6];
        __IO uint32_t CTLD;     /*!< Amp D Register                               */
    } TSB_AMP_TypeDef;

/**
  * @brief Watchdog Timer (WD)
  */
    typedef struct {
        __IO uint32_t MOD;      /*!< WD Mode Register                             */
        __O uint32_t CR;        /*!< WD Control Register                          */
    } TSB_WD_TypeDef;

/**
  * @brief Clock Generator (CG)
  */
    typedef struct {
        __IO uint32_t SYSCR;    /*!< System Control Register                      */
        __IO uint32_t OSCCR;    /*!< Oscillation Control Register                 */
        __IO uint32_t STBYCR;   /*!< Standby Control Register                     */
        __IO uint32_t PLLSEL;   /*!< PLL Selection Register                       */
        uint32_t RESERVED0;
        __O uint32_t ICRCG;     /*!< CG Interrupt Request Clear Register          */
        __I uint32_t NMIFLG;    /*!< NMI Flag Register                            */
        __IO uint32_t RSTFLG;   /*!< Reset Flag Register                          */
        __IO uint32_t IMCGA;    /*!< CG Interrupt Mode Control Register A         */
    } TSB_CG_TypeDef;

/**
  * @brief Internal High-speed Oscillation Adjustment
  */
    typedef struct {
        __IO uint32_t PRO;      /*!< Protect Register                             */
        __IO uint32_t EN;       /*!< Enable Register                              */
        __I uint32_t INIT;      /*!< Initial Trimming Value Monitor Register      */
        __IO uint32_t SET;      /*!< Timming Value Setting Register               */
    } TSB_TRMOSC_TypeDef;

/**
  * @brief Oscillation Frequency Detector (OFD)
  */
    typedef struct {
        __IO uint32_t CR1;      /*!< OFD Control Register 1                       */
        __IO uint32_t CR2;      /*!< OFD Control Register 2                       */
        __IO uint32_t MNPLLOFF; /*!< OFD Lower Detection Frequency Setting Register */
        __IO uint32_t MNPLLON;  /*!< OFD Lower Detection Frequency Setting Register */
        __IO uint32_t MXPLLOFF; /*!< OFD Higher Detection Frequency Setting Register */
        __IO uint32_t MXPLLON;  /*!< OFD Higher Detection Frequency Setting Register */
    } TSB_OFD_TypeDef;

/**
  * @brief Low Voltage Detection Circuit
  */
    typedef struct {
        __IO uint32_t CR;       /*!< VD Control Register                          */
    } TSB_VD_TypeDef;

