MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM37AFSQG/mcu.h
/* Clock Generator (CG) */
#define TSB_CG_SYSCR_FPSEL                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,12)))
#define TSB_CG_OSCCR_WUEON                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,0)))
#define TSB_CG_OSCCR_WUEF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,1)))
#define TSB_CG_OSCCR_PLLON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,2)))
#define TSB_CG_OSCCR_WUPSEL1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,3)))
#define TSB_CG_OSCCR_XEN1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,8)))
#define TSB_CG_OSCCR_XEN2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,16)))
#define TSB_CG_OSCCR_OSCSEL                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,17)))
#define TSB_CG_OSCCR_HOSCON                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,18)))
#define TSB_CG_OSCCR_WUPSEL2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,19)))
#define TSB_CG_STBYCR_RXEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->STBYCR,8)))
#define TSB_CG_STBYCR_DRVE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->STBYCR,16)))
#define TSB_CG_PLLSEL_PLLSEL                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->PLLSEL,0)))
#define TSB_CG_RSTFLG_PONRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,0)))
#define TSB_CG_RSTFLG_PINRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,1)))
#define TSB_CG_RSTFLG_WDTRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,2)))
#define TSB_CG_RSTFLG_VLTDRSTF                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,3)))
#define TSB_CG_RSTFLG_DBGRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,4)))
#define TSB_CG_RSTFLG_OFDRSTF                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->RSTFLG,5)))
#define TSB_CG_IMCGA_INT0EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,0)))
#define TSB_CG_IMCGA_INT1EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,8)))
#define TSB_CG_IMCGA_INT2EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,16)))


/* Internal High-speed Oscillation Adjustment */
#define TSB_TRMOSC_EN_TRIMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TRMOSC->EN,0)))



/* Low Voltage Detection Circuit */
#define TSB_VD_CR_VDEN                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_VD->CR,0)))


/* Vector Engine (VE) */
#define TSB_VE_EN_VEEN                            (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->EN,0)))
#define TSB_VE_EN_VEIDLEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->EN,1)))
#define TSB_VE_ERRINTEN_VERRENB                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->ERRINTEN,1)))
#define TSB_VE_SCHTASKRUN_VRSCHB                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_VE->SCHTASKRUN,5)))
#define TSB_VE_MCTLF1_LAVF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->MCTLF1,0)))
#define TSB_VE_MCTLF1_LAVFM                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->MCTLF1,1)))
#define TSB_VE_MCTLF1_LVTF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->MCTLF1,2)))
#define TSB_VE_MCTLF1_PLSLF                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->MCTLF1,4)))
#define TSB_VE_MCTLF1_PLSLFM                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->MCTLF1,5)))
#define TSB_VE_MODE1_PVIEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->MODE1,0)))
#define TSB_VE_MODE1_ZIEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->MODE1,1)))
#define TSB_VE_MODE1_VDCSEL                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->MODE1,4)))
#define TSB_VE_MODE1_T4ATANEN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->MODE1,6)))
#define TSB_VE_MODE1_T7SQRTEN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->MODE1,7)))
#define TSB_VE_FMODE1_C2PEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->FMODE1,0)))
#define TSB_VE_FMODE1_SPWMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->FMODE1,1)))
#define TSB_VE_FMODE1_IDPLMD                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->FMODE1,5)))
#define TSB_VE_FMODE1_CRCEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->FMODE1,8)))
#define TSB_VE_FMODE1_MREGDIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->FMODE1,9)))
#define TSB_VE_FMODE1_PIGSEL                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->FMODE1,11)))
#define TSB_VE_FMODE1_PHCVDIS                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->FMODE1,12)))
#define TSB_VE_OUTCR1_UPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->OUTCR1,6)))
#define TSB_VE_OUTCR1_VPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->OUTCR1,7)))
#define TSB_VE_OUTCR1_WPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_VE->OUTCR1,8)))
#define TSB_VE_EMGRS1_EMGRS                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_VE->EMGRS1,0)))


/* 16-bit Multi-Purpose Timer (MPT-PMD) */
#define TSB_PMD_MDEN_PWMEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MDEN,0)))
#define TSB_PMD_MDCR_PWMMD                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MDCR,0)))
#define TSB_PMD_MDCR_PINT                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MDCR,3)))
#define TSB_PMD_MDCR_DTYMD                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MDCR,4)))
#define TSB_PMD_MDCR_SYNTMD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MDCR,5)))
#define TSB_PMD_MDCR_PWMCK                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MDCR,6)))
#define TSB_PMD_MDCR_DTCREN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MDCR,7)))
#define TSB_PMD_CNTSTA_UPDWN                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_PMD->CNTSTA,0)))
#define TSB_PMD_MODESEL_MDSEL0                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MODESEL,0)))
#define TSB_PMD_MODESEL_MDSEL1                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MODESEL,1)))
#define TSB_PMD_MODESEL_MDSEL2                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MODESEL,2)))
#define TSB_PMD_MODESEL_MDSEL3                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MODESEL,3)))
#define TSB_PMD_MODESEL_DCMPEN                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MODESEL,7)))
#define TSB_PMD_MDOUT_UPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MDOUT,8)))
#define TSB_PMD_MDOUT_VPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MDOUT,9)))
#define TSB_PMD_MDOUT_WPWM                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MDOUT,10)))
#define TSB_PMD_MDPOT_POLL                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MDPOT,2)))
#define TSB_PMD_MDPOT_POLH                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->MDPOT,3)))
#define TSB_PMD_EMGCR_EMGEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->EMGCR,0)))
#define TSB_PMD_EMGCR_EMGRS                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_PMD->EMGCR,1)))
#define TSB_PMD_EMGCR_INHEN                       (*((__O  uint32_t *)BITBAND_PERI(&TSB_PMD->EMGCR,5)))
#define TSB_PMD_EMGSTA_EMGST                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_PMD->EMGSTA,0)))
#define TSB_PMD_EMGSTA_EMGI                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_PMD->EMGSTA,1)))
#define TSB_PMD_OVVCR_OVVEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->OVVCR,0)))
#define TSB_PMD_OVVCR_OVVRS                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->OVVCR,1)))
#define TSB_PMD_OVVCR_OVVISEL                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->OVVCR,2)))
#define TSB_PMD_OVVCR_ADIN0EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->OVVCR,5)))
#define TSB_PMD_OVVCR_ADIN1EN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->OVVCR,6)))
#define TSB_PMD_OVVSTA_OVVST                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_PMD->OVVSTA,0)))
#define TSB_PMD_OVVSTA_OVVI                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_PMD->OVVSTA,1)))
#define TSB_PMD_TRGCR_TRG0BE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->TRGCR,3)))
#define TSB_PMD_TRGCR_TRG1BE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->TRGCR,7)))
#define TSB_PMD_TRGCR_TRG2BE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->TRGCR,11)))
#define TSB_PMD_TRGCR_TRG3BE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->TRGCR,15)))
#define TSB_PMD_TRGMD_EMGTGE                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->TRGMD,0)))
#define TSB_PMD_TRGMD_TRGOUT                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_PMD->TRGMD,1)))


/* DigitalNoizeFilterClockControl */
#define TSB_NF_ENCR_NFEN0                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_NF->ENCR,0)))
#define TSB_NF_ENCR_NFEN1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_NF->ENCR,1)))
#define TSB_NF_ENCR_NFEN2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_NF->ENCR,2)))

    /** @} *//* End of group Device_Peripheral_registers */

#ifdef __cplusplus
}
#endif

#endif  /* __TMPM37A_H__ */

/** @} *//* End of group TMPM37A */
/** @} *//* End of group TOSHIBA_TX03_MICROCONTROLLER */
